In [1]:
import pandas as pd
import re

In [2]:
filename = "C:\\Users\parenti daniele\\code-projects\\advent-of-code\\day1\\trebuchet-input.txt"
# filename = "C:\\Users\parenti daniele\\code-projects\\advent-of-code\\day1\\test.txt"

## Part 1

In [3]:
# put into a dataframe
df =  pd.read_csv(filename, names=['input'])
# extract first digit into a new column
df['first'] = df['input'].str.extract('(\d)')
# extract last digit into a new column
df['last'] = df['input'].str.extract('(\d)[^\d]*$')
# concatenate columns
df['concat']=df["first"].astype(str) + df["last"]
df['concat']=df['concat'].astype(int)

#sum column
print(df['concat'].sum())

54338

## Part 2

In [4]:
df =  pd.read_csv(filename, names=['input'])
df

                             input
0     2911threeninesdvxvheightwobm
1       3three16xsxhpnqmzmnine8one
2                seven5khtwo891hlb
3                sixthreeqpzjpn195
4                            jrnf3
..                             ...
995               7783twonineeight
996                      1fourfour
997      4fourztnthreeone8mqmdfour
998  fbfvqgvqfone5nctdcdpteighttwo
999            dhfbhone4fourlgzftg

[1000 rows x 1 columns]

In [5]:
def extract_and_concatenate(input_string):
    # Mapping of number words to digits
    number_word_to_digit = {
        "one": 1, "two": 2, "three": 3, "four": 4, "five": 5, 
        "six": 6, "seven": 7, "eight": 8, "nine": 9, "zero": 0
    }

    # Regular expression pattern with lookahead for digits or number words
    pattern = r'(?=(\d|one|two|three|four|five|six|seven|eight|nine|zero))'

    # Find all matches
    matches = list(re.finditer(pattern, input_string))
    if matches:
        # Extract the first and last match
        first_match = matches[0].group(1)
        last_match = matches[-1].group(1)

        # Convert the number words to digits
        first_number = number_word_to_digit.get(first_match, first_match)
        last_number = number_word_to_digit.get(last_match, last_match)

        # Concatenate these numbers to form a two-digit number
        concatenated_number = f"{first_number}{last_number}"
        return concatenated_number
    else:
        raise ValueError

In [6]:
# Test the function with the provided examples
test_strings = [
    "eighthree", "sevenine", "two1nine", "twotwone", "eightwothree",
    "abcone2threexyz", "4nineeightseven2", "zoneight234", "7pqrstsixteen", "qwef3", "onenoid", "124", "7"
]

[extract_and_concatenate(s) for s in test_strings]

['83', '79', '29', '21', '83', '13', '42', '14', '76', '33', '11', '14', '77']

In [7]:
df['number']=df['input'].apply(lambda x: extract_and_concatenate(x)).astype(int)
df

                             input  number
0     2911threeninesdvxvheightwobm      22
1       3three16xsxhpnqmzmnine8one      31
2                seven5khtwo891hlb      71
3                sixthreeqpzjpn195      65
4                            jrnf3      33
..                             ...     ...
995               7783twonineeight      78
996                      1fourfour      14
997      4fourztnthreeone8mqmdfour      44
998  fbfvqgvqfone5nctdcdpteighttwo      12
999            dhfbhone4fourlgzftg      14

[1000 rows x 2 columns]

In [8]:
df.number.sum()

53389